conver/conver/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue p 101325
);

regions
(
    boxToCell
    {
        box (-0.04 -0.1 -0.2) (0.015 0.03 0.2);

        fieldValues
        (
            volScalarFieldValue p 2161385.7
        );
    }

    boxToCell
    {
        box (0.015 -0.1 -0.2) (0.02 0.009 0.2);

        fieldValues
        (
            volScalarFieldValue p 2161385.7
        );
    }


);


// ************************************************************************* //
